export interface EventItem {
    year: number;
    text: string;
    id: number;
}

export type DataItem = {
    name: string;
    events: EventItem[];
};

export const data: DataItem[] = [
    {
        name: "First",
        events: [
            {
                year: 2015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 0,
            },
            {
                year: 2016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 1,
            },
            {
                year: 2017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 2,
            },
            {
                year: 2018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 3,
            },
            {
                year: 2019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 4,
            },
            {
                year: 2022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 5,
            },
        ],
    },
    {
        name: "Second",
        events: [
            {
                year: 3015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 6,
            },
            {
                year: 3016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 7,
            },
            {
                year: 3017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 8,
            },
            {
                year: 3018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 9,
            },
            {
                year: 3019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 10,
            },
            {
                year: 3022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 11,
            },
        ],
    },
    {
        name: "Third",
        events: [
            {
                year: 4015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 12,
            },
            {
                year: 4016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 13,
            },
            {
                year: 4017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 14,
            },
            {
                year: 4018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 15,
            },
            {
                year: 4019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 16,
            },
            {
                year: 4022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 17,
            },
        ],
    },
    {
        name: "Fourth",
        events: [
            {
                year: 5015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 18,
            },
            {
                year: 5016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 19,
            },
            {
                year: 5017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 20,
            },
            {
                year: 5018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 21,
            },
            {
                year: 5019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 22,
            },
            {
                year: 5022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 23,
            },
        ],
    },
    {
        name: "Fifth",
        events: [
            {
                year: 6015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 24,
            },
            {
                year: 6016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 25,
            },
            {
                year: 6017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 26,
            },
            {
                year: 6018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 27,
            },
            {
                year: 6019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 28,
            },
            {
                year: 6022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 29,
            },
        ],
    },
    {
        name: "Sixth",
        events: [
            {
                year: 7015,
                text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
                id: 30,
            },
            {
                year: 7016,
                text: "Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11.",
                id: 31,
            },
            {
                year: 7017,
                text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
                id: 32,
            },
            {
                year: 7018,
                text: "Научные достижения в области квантовой физики привлекли большое внимание общественности.",
                id: 33,
            },
            {
                year: 7019,
                text: "Международные космические агентства объединились для создания программы освоения Луны.",
                id: 34,
            },
            {
                year: 7022,
                text: "Впервые удалось создать термоядерную реакцию, превышающую по мощности её затраты.",
                id: 35,
            },
        ],
    },
];
